
## Plan Result

[CI link](https://github.com/Terraform-TEST0928/terraform-infra/actions/runs/17317763541)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.ci_test.aws_s3_bucket.ci_test
  * module.ci_test.aws_s3_bucket_ownership_controls.image_delivery
  * module.ci_test.aws_s3_bucket_public_access_block.image_delivery


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.ci_test.aws_s3_bucket.ci_test will be created
  + resource "aws_s3_bucket" "ci_test" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "nyj-dev01-ci-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.ci_test.aws_s3_bucket_ownership_controls.image_delivery will be created
  + resource "aws_s3_bucket_ownership_controls" "image_delivery" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.ci_test.aws_s3_bucket_public_access_block.image_delivery will be created
  + resource "aws_s3_bucket_public_access_block" "image_delivery" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"CI_terraform","PRNumber":8,"Program":"tfcmt","SHA1":"98239d95c90f311763415c65a37e0a6c03cd7893","Vars":{},"WorkflowName":"Terraform CI"} -->